## Home work

### 1.	Construct the following dataset with the name of ‘data’ using pd.DataFrame().

In [48]:
import pandas as pd

In [24]:
data={'dog_ID':[123,456,821,198,3,42],
       'age':[4,3,6,4,2,5],
      'Color':['brown','grey','golden','grey','black','brown'],
      "fur":["shaggy",'short','curly','shaggy','curly','shaggy'],
      'name':['odie','gabe','samosa','gabe','bob barker','odie']}

In [27]:
data = pd.DataFrame(data)

In [28]:
data = data.set_index("dog_ID")
data

        age   Color     fur        name
dog_ID
123       4   brown  shaggy        odie
456       3    grey   short        gabe
821       6  golden   curly      samosa
198       4    grey  shaggy        gabe
3         2   black   curly  bob barker
42        5   brown  shaggy        odie

### 2. Show the name of the oldest dog.

In [35]:
data.loc[data['age'].sort_values(ascending=False)[:1].index,"name"]

dog_ID
821    samosa
Name: name, dtype: object

### 3. Show proportion of dogs had the most common fur type. (For instance, if the most common fur type was curly, what proportion of dogs had curly fur?)

In [39]:
data['fur'].value_counts(normalize=True).sort_values(ascending=False)[:1]

shaggy    0.5
Name: fur, dtype: float64

### 4.	Please show the 1st quantile(25 percentile) of ‘age’.

In [47]:
data['age'].quantile(q=0.25)

3.25

### 5.	Import the ‘HR-employee.xls’ dataset and select the subset of the data that have the following structure.

In [2]:
data = pd.read_excel("HR-Employee-Attrition.xlsx", index_col="EmployeeNumber")

In [3]:
selecting_columns=["Age","Attrition",'BusinessTravel','DailyRate','Department','DistanceFromHome','Education','EducationField']
subset_data = data[selecting_columns]

In [4]:
subset_data.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField
EmployeeNumber,,,,,,,,
1,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences
2,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences
4,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other
5,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences
7,27,No,Travel_Rarely,591,Research & Development,2,1,Medical

### 6.	Please select the employee whose age is equal to 41.

In [5]:
subset_data[subset_data["Age"]==41].head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField
EmployeeNumber,,,,,,,,
1,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences
58,41,Yes,Travel_Rarely,1360,Research & Development,12,3,Technical Degree
176,41,No,Travel_Rarely,802,Sales,9,1,Life Sciences
199,41,No,Travel_Frequently,857,Research & Development,10,3,Life Sciences
200,41,No,Travel_Rarely,933,Research & Development,9,4,Life Sciences

### 7.	Sort the selected dataset based on Age in descending order.

In [6]:
subset_data.sort_values(by=["Age"],axis=0,ascending=False).head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField
EmployeeNumber,,,,,,,,
1697,60,No,Travel_Rarely,370,Research & Development,1,4,Medical
573,60,No,Travel_Frequently,1499,Sales,28,3,Marketing
732,60,No,Travel_Rarely,1179,Sales,16,4,Marketing
549,60,No,Travel_Rarely,422,Research & Development,7,3,Life Sciences
1233,60,No,Travel_Rarely,696,Sales,7,4,Marketing

### 8.	Please show the proportion of the people based on the values of ‘Attrition’ in the selected dataset.

In [7]:
subset_data['Attrition'].value_counts(normalize=True)

No     0.838776
Yes    0.161224
Name: Attrition, dtype: float64

### 9.	Please create the following two datasets.

In [8]:
data1 = pd.DataFrame({"key1":['Ohio','Nevada','New York'],
                    'data':[2000,2001,2002]})

In [9]:
data1

       key1  data
0      Ohio  2000
1    Nevada  2001
2  New York  2002

In [10]:
data2 = pd.DataFrame({"key1":['Nevada','Ohio','Iowa'],
                     'data2':[2001,2000,2003]})

In [11]:
data2

     key1  data2
0  Nevada   2001
1    Ohio   2000
2    Iowa   2003

### 10.	Please get the following dataset by merging the above two datasets

In [12]:
merged_data = data1.merge(data2,how="outer",on='key1')

In [13]:
merged_data

       key1    data   data2
0      Ohio  2000.0  2000.0
1    Nevada  2001.0  2001.0
2  New York  2002.0     NaN
3      Iowa     NaN  2003.0